/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 80015
Source Host           : localhost:3306
Source Database       : baiduapi

Target Server Type    : MYSQL
Target Server Version : 80015
File Encoding         : 65001

Date: 2019-08-24 19:14:17
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for government
-- ----------------------------
DROP TABLE IF EXISTS `government`;
CREATE TABLE `government` (
  `name` varchar(255) DEFAULT NULL,
  `province` varchar(255) DEFAULT NULL,
  `city` varchar(255) DEFAULT NULL,
  `area` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `tag` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `overall_rating` varchar(255) DEFAULT NULL,
  `location_lat` float DEFAULT NULL,
  `location_lng` float DEFAULT NULL,
  `navi_location_lat` float DEFAULT NULL,
  `navi_location_lng` float DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- ----------------------------
-- Records of government
-- ----------------------------
INSERT INTO `government` VALUES ('北京昌平区人民政府', '北京市', '北京市', '昌平区', '北京市昌平区政府街19号', '政府机构;各级政府', 'life', '4.2', '40.2268', '116.238', '40.2262', '116.237');
INSERT INTO `government` VALUES ('上海市政府', '上海市', '上海市', '黄浦区', '上海市黄浦区人民大道200号', '政府机构;各级政府', 'life', '4.9', '31.2363', '121.48', '31.2362', '121.481');
INSERT INTO `government` VALUES ('广州市花都区人民政府', '广东省', '广州市', '花都区', '广州市花都区迎宾大道89号', '政府机构;各级政府', 'life', '5.0', '23.4096', '113.227', '23.4102', '113.226');
INSERT INTO `government` VALUES ('深圳市人民政府', '广东省', '深圳市', '福田区', '深圳市福田区福中三路市民中心C区', '政府机构;各级政府', 'life', '4.6', '22.5492', '114.065', '22.5485', '114.065');
INSERT INTO `government` VALUES ('武汉市人民政府', '湖北省', '武汉市', '江岸区', '武汉市江岸区沿江大道188号', '政府机构;各级政府', 'life', '4.2', '30.5986', '114.312', '30.5983', '114.312');
INSERT INTO `government` VALUES ('西安市人民政府', '陕西省', '西安市', '未央区', '西安市未央区凤城八路109号', '政府机构;各级政府', 'life', '5.0', '34.3494', '108.946', '34.3473', '108.946');
INSERT INTO `government` VALUES ('杭州市人民政府', '浙江省', '杭州市', '江干区', '杭州市江干区解放东路18号市民中心A座', '政府机构;各级政府', 'life', '4.4', '30.2519', '120.216', '30.251', '120.215');
INSERT INTO `government` VALUES ('南京市人民政府', '江苏省', '南京市', '玄武区', '南京市玄武区北京东路41号', '政府机构;各级政府', 'life', '4.2', '32.0666', '118.803', '32.0646', '118.803');
INSERT INTO `government` VALUES ('成都市政府', '四川省', '成都市', '武侯区', '成都市武侯区高新区锦悦西路2号', '政府机构;各级政府', 'life', '3.2', '30.579', '104.073', '30.5781', '104.073');
INSERT INTO `government` VALUES ('重庆市政府', '重庆市', '重庆市', '渝中区', '重庆市渝中区人民路232号', '政府机构;各级政府', 'life', '4.7', '29.57', '106.557', '29.5689', '106.558');
INSERT INTO `government` VALUES ('东莞市政府', '广东省', '东莞市', '', '东莞市鸿福路99号', '政府机构;各级政府', 'life', '5.0', '23.0273', '113.758', '23.0274', '113.756');
INSERT INTO `government` VALUES ('大连市政府', '辽宁省', '大连市', '西岗区', '大连市西岗区人民广场1号', '政府机构;各级政府', 'life', '5.0', '38.9197', '121.621', '38.919', '121.622');
INSERT INTO `government` VALUES ('沈阳市政府', '辽宁省', '沈阳市', '浑南区', '沈阳市浑南区沈中大街206号', '政府机构;各级政府', 'life', '4.0', '41.6837', '123.471', '41.683', '123.473');
INSERT INTO `government` VALUES ('苏州市政府', '江苏省', '苏州市', '姑苏区', '苏州市姑苏区三香路998号', '政府机构;各级政府', 'life', '4.3', '31.306', '120.592', '31.3037', '120.593');
INSERT INTO `government` VALUES ('昆明市人民政府', '云南省', '昆明市', '呈贡区', '云南省昆明市呈贡新区锦绣大街1号', '政府机构;各级政府', 'life', '5.0', '24.8878', '102.84', '24.8859', '102.84');
INSERT INTO `government` VALUES ('长沙市政府', '湖南省', '长沙市', '岳麓区', '长沙市岳麓区岳麓大道218号', '政府机构;各级政府', 'life', '4.0', '28.2345', '112.945', '28.2341', '112.946');
INSERT INTO `government` VALUES ('合肥市人民政府', '安徽省', '合肥市', '蜀山区', '合肥市蜀山区东流路100号', '政府机构;各级政府', 'life', '3.8', '31.827', '117.234', '31.8265', '117.234');
INSERT INTO `government` VALUES ('宁波市人民政府', '浙江省', '宁波市', '鄞州区', '宁波市鄞州区宁穿路2001号', '政府机构;各级政府', 'life', '5.0', '29.866', '121.631', '29.8648', '121.63');
INSERT INTO `government` VALUES ('郑州市人民政府', '河南省', '郑州市', '中原区', '郑州市中原区中原西路233号', '政府机构;各级政府', 'life', '3.8', '34.7526', '113.632', '34.7536', '113.632');
INSERT INTO `government` VALUES ('天津市政府', '天津市', '天津市', '河西区', '天津市河西区友谊路30号', '政府机构;各级政府', 'life', '3.3', '39.0911', '117.208', '39.0894', '117.207');
INSERT INTO `government` VALUES ('青岛市政府', '山东省', '青岛市', '市南区', '青岛市市南区香港中路11号', '政府机构;各级政府', 'life', '3.7', '36.073', '120.389', '36.0724', '120.39');
INSERT INTO `government` VALUES ('长春市政府', '吉林省', '长春市', '南关区', '长春市南关区人民大街10111号', '政府机构;各级政府', 'life', null, '43.8228', '125.33', '43.8235', '125.33');
INSERT INTO `government` VALUES ('哈尔滨市政府', '黑龙江省', '哈尔滨市', '松北区', '哈尔滨市松北区世纪大道1号', '政府机构;各级政府', 'life', '4.0', '45.8086', '126.542', '45.8083', '126.545');
INSERT INTO `government` VALUES ('济南市人民政府', '山东省', '济南市', '历下区', '济南市历下区龙鼎大道1号', '政府机构;各级政府', 'life', '5.0', '36.6584', '117.127', '36.6565', '117.127');
INSERT INTO `government` VALUES ('厦门市人民政府', '福建省', '厦门市', '思明区', '厦门市思明区湖滨北路61号', '政府机构;各级政府', 'life', '4.5', '24.486', '118.096', '24.4855', '118.096');
INSERT INTO `government` VALUES ('无锡市人民政府', '江苏省', '无锡市', '滨湖区', '江苏省无锡市滨湖区新金匮路1号', '政府机构;各级政府', 'life', '4.5', '31.4974', '120.319', '31.4988', '120.318');
INSERT INTO `government` VALUES ('常州市人民政府', '江苏省', '常州市', '新北区', '龙城大道1280号', '政府机构;各级政府', 'life', '5.0', '31.8174', '119.981', '31.8158', '119.981');
INSERT INTO `government` VALUES ('佛山市人民政府', '广东省', '佛山市', '禅城区', '佛山市禅城区岭南大道北12号', '政府机构;各级政府', 'life', '3.7', '23.0272', '113.128', '23.0277', '113.129');
INSERT INTO `government` VALUES ('香港政府-员警总部', '香港特别行政区', '香港特别行政区', '中西区', '香港湾仔军器厂街警政大楼西翼2603室', '政府机构;各级政府', 'life', null, '22.2812', '114.179', '22.2812', '114.179');
INSERT INTO `government` VALUES ('澳门政府旅游局', '澳门特别行政区', '澳门特别行政区', '澳门半岛', '澳门 Largo do Senado, Edif. Ritz', '旅游景点;其他', 'scope', '4.4', '22.1971', '113.551', null, null);
INSERT INTO `government` VALUES ('南通市政府', '江苏省', '南通市', '崇川区', '南通市崇川区世纪大道6号', '政府机构;各级政府', 'life', '5.0', '31.9869', '120.901', '31.9855', '120.901');
INSERT INTO `government` VALUES ('淄博市人民政府', '山东省', '淄博市', '张店区', '淄博市张店区人民西路8号', '政府机构;各级政府', 'life', null, '36.8198', '118.062', '36.8192', '118.061');
INSERT INTO `government` VALUES ('泉州市人民政府', '福建省', '泉州市', '丰泽区', '泉州市丰泽区海星街行政中心', '政府机构;各级政府', 'life', '4.7', '24.8812', '118.682', '24.8791', '118.681');
INSERT INTO `government` VALUES ('福州市人民政府', '福建省', '福州市', '鼓楼区', '福州市鼓楼区乌山路96号', '政府机构;各级政府', 'life', '4.8', '26.0806', '119.303', '26.0802', '119.303');
INSERT INTO `government` VALUES ('贵阳市政府', '贵州省', '贵阳市', '观山湖区', '贵阳市观山湖区林城东路7号', '政府机构;各级政府', 'life', '4.8', '26.6524', '106.635', '26.651', '106.632');
INSERT INTO `government` VALUES ('南宁市人民政府', '广西壮族自治区', '南宁市', '青秀区', '南宁市青秀区嘉宾路1号', '政府机构;各级政府', 'life', '0.0', '22.8238', '108.373', '22.8234', '108.372');
INSERT INTO `government` VALUES ('石家庄市人民政府', '河北省', '石家庄市', '长安区', '石家庄市长安区中山东路216号', '政府机构;各级政府', 'life', '2.0', '38.0483', '114.521', '38.0488', '114.521');
INSERT INTO `government` VALUES ('唐山市政府', '河北省', '唐山市', '路北区', '唐山市路北区西山道3号', '政府机构;各级政府', 'life', '5.0', '39.6369', '118.187', '39.6365', '118.187');
INSERT INTO `government` VALUES ('太原市人民政府', '山西省', '太原市', '杏花岭区', '太原市杏花岭区新建路69号', '政府机构;各级政府', 'life', '3.0', '37.8769', '112.556', '37.8768', '112.557');
INSERT INTO `government` VALUES ('烟台市人民政府', '山东省', '烟台市', '莱山区', '烟台市芙蓉路6号', '政府机构;各级政府', 'life', '0.0', '37.4709', '121.454', '37.4698', '121.455');
INSERT INTO `government` VALUES ('威海市人民政府', '山东省', '威海市', '环翠区', '威海市环翠区新威路1号', '政府机构;各级政府', 'life', '3.8', '37.5191', '122.127', '37.5193', '122.128');
INSERT INTO `government` VALUES ('乌鲁木齐市人民政府', '新疆维吾尔自治区', '乌鲁木齐市', '水磨沟区', '新疆维吾尔自治区乌鲁木齐市水磨沟区南湖东路30号', '政府机构;各级政府', 'life', '4.3', '43.8316', '87.6233', '43.8321', '87.6224');
INSERT INTO `government` VALUES ('呼和浩特市政府', '内蒙古自治区', '呼和浩特市', '新城区', '呼和浩特市新城区新华东街1号', '政府机构;各级政府', 'life', '4.0', '40.8481', '111.755', '40.8481', '111.758');
INSERT INTO `government` VALUES ('兰州市政府', '甘肃省', '兰州市', '城关区', '兰州市城关区南滨河东路637号', '政府机构;各级政府', 'life', '4.0', '36.0667', '103.841', '36.0674', '103.841');
INSERT INTO `government` VALUES ('西宁市政府', '青海省', '西宁市', '城中区', '西宁市城中区南关街43号', '政府机构;各级政府', 'life', '5.0', '36.6232', '101.785', '36.6236', '101.785');
INSERT INTO `government` VALUES ('宁夏回族自治区人民政府', '宁夏回族自治区', '银川市', '兴庆区', '银川市兴庆区解放西街361号', '政府机构;各级政府', 'life', null, '38.4779', '106.265', '38.4765', '106.265');
INSERT INTO `government` VALUES ('徐州市人民政府', '江苏省', '徐州市', '云龙区', '昆仑大道1号', '政府机构;各级政府', 'life', '5.0', '34.21', '117.29', '34.2128', '117.291');
INSERT INTO `government` VALUES ('拉萨市政府', '西藏自治区', '拉萨市', '城关区', '拉萨市城关区江苏大道69号', '政府机构;各级政府', 'life', '0.0', '29.6595', '91.1785', '29.6582', '91.1785');
INSERT INTO `government` VALUES ('南昌市政府', '江西省', '南昌市', '东湖区', '南昌市红谷滩新区新府路118号', '政府机构;各级政府', 'life', '1.0', '28.6887', '115.865', '28.6878', '115.864');
INSERT INTO `government` VALUES ('桂林市政府', '广西壮族自治区', '桂林市', '临桂区', '桂林市临桂区西城中路69号', '政府机构;各级政府', 'life', '4.8', '25.2418', '110.186', '25.2403', '110.188');
INSERT INTO `government` VALUES ('芜湖市政府', '安徽省', '芜湖市', '鸠江区', '芜湖市鸠江区政通路66号', '政府机构;各级政府', 'life', '3.2', '31.3589', '118.439', '31.3587', '118.44');
INSERT INTO `government` VALUES ('海口市政府', '海南省', '海口市', '秀英区', '海南省海口市秀英区长滨东四街6号', '政府机构;各级政府', 'life', '5.0', '20.0521', '110.207', '20.0496', '110.207');
INSERT INTO `government` VALUES ('三亚市人民政府', '海南省', '三亚市', '吉阳区', '三亚市吉阳区新风街257号', '政府机构;各级政府', 'life', '2.9', '18.2587', '109.519', '18.2581', '109.518');
INSERT INTO `government` VALUES ('泰安市人民政府', '山东省', '泰安市', '泰山区', '泰安市泰山区望岳东路3号', '政府机构;各级政府', 'life', '4.8', '36.2063', '117.093', '36.2058', '117.095');
INSERT INTO `government` VALUES ('张家界市政府', '湖南省', '张家界市', '永定区', '张家界市南庄路2号', '政府机构;各级政府', 'life', '5.0', '29.1228', '110.486', '29.1227', '110.486');
INSERT INTO `government` VALUES ('景德镇市政府', '江西省', '景德镇市', '昌江区', '景德镇市昌江区瓷都大道686号', '政府机构;各级政府', 'life', '0.0', '29.2745', '117.185', '29.2743', '117.185');
